todoistFake.yml
config:
  target: "https://api.todoist.com/rest/v1"
  phases:
    - duration: 6
      arrivalRate: 1
      name: Performance Test
  plugins:
    faker:
      locale: en
  variables:
    firstName: "$faker.name.firstName"
    date: "$faker.date.future"
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-type: application/json
scenarios:
  # Using Faker 
  - name: "Using Faker with Artillery"
    flow:
    #Create a new  faker task 
      - post:
          url: "/tasks"
          body: '{ "content": "Meeting with {{ firstName }}", "due_datetime": {{ date }}, "due_lang": "en",  "priority": 4, "project_id": 2261210765}'  
          capture:
            json: "$.id"
            as: "id"
      - log: "Create meeting {{ id }}  with {{ firstName }} on {{ date }}"
    #Delete task
      - delete:
          url: "/tasks/{{ id }}"
      - log: "Deleting meeting {{ id }}  with {{ firstName }} on {{ date }}"